Revit 2027 API
BuiltInFailures.SketchFailures.SuspendedSketchWarn Property
 Highlighted element's sketch could not regenerate and has been suspended. Select the element and edit its sketch to fix the problem. The element will display in magenta until you fix the problem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SuspendedSketchWarn { get; }
Public Shared ReadOnly Property SuspendedSketchWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SuspendedSketchWarn {
	FailureDefinitionId^ get ();
}
static member SuspendedSketchWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace